In [2]:
#Concatnate is an operation that we need when we want to join two or more data frame.

In [3]:
import pandas as pd

In [4]:
uk_weather=pd.DataFrame({"City": ["London", "Birmingham", "Manchester"],
           "Temperature": [10, 7, 12],
            "Humidity": [12, 10,14],
            "Code": ["LN", "BM", "MN"]
           })

In [5]:
uk_weather["Code"].is_unique

True

In [6]:
uk_weather

         City  Temperature  Humidity Code
0      London           10        12   LN
1  Birmingham            7        10   BM
2  Manchester           12        14   MN

In [7]:
uk_weather.set_index("Code", inplace=True)

In [8]:
uk_weather.loc[:,"Humidity"]

Code
LN    12
BM    10
MN    14
Name: Humidity, dtype: int64

In [9]:
uk_weather.iloc[:,1:3]

      Temperature  Humidity
Code
LN             10        12
BM              7        10
MN             12        14

In [10]:
denmark_weather=pd.DataFrame({"City": ["Copenhagen","Aarhus", "Odense"],
                 "Temperature": [21, 24, 22],
                 "Humidity": [14, 17, 16]
                
                })

In [11]:
denmark_weather

         City  Temperature  Humidity
0  Copenhagen           21        14
1      Aarhus           24        17
2      Odense           22        16

In [12]:
list1=["CP", "AH", "OD"]

In [13]:
denmark_weather["Code"]=list1

In [14]:
denmark_weather["Code"].is_unique

True

In [15]:
denmark_weather.set_index("Code", inplace=True)

In [16]:
denmark_weather

            City  Temperature  Humidity
Code
CP    Copenhagen           21        14
AH        Aarhus           24        17
OD        Odense           22        16

In [17]:
rd=pd.concat([uk_weather, denmark_weather], keys=["United Kingdom", "Denmark"]) #Keys associates to uk_weather and denmark_weather with particular names

In [18]:
rd

                           City  Temperature  Humidity
               Code
United Kingdom LN        London           10        12
               BM    Birmingham            7        10
               MN    Manchester           12        14
Denmark        CP    Copenhagen           21        14
               AH        Aarhus           24        17
               OD        Odense           22        16

In [19]:
rd.loc["United Kingdom"]

            City  Temperature  Humidity
Code
LN        London           10        12
BM    Birmingham            7        10
MN    Manchester           12        14

In [20]:
rd.loc["Denmark"]

            City  Temperature  Humidity
Code
CP    Copenhagen           21        14
AH        Aarhus           24        17
OD        Odense           22        16

In [21]:
city_in_uk=pd.DataFrame({"City name": ["London", "Birmingham", "Liverpool", "Manchester", "Bradford"]})

In [22]:
city_in_uk

    City name
0      London
1  Birmingham
2   Liverpool
3  Manchester
4    Bradford

In [23]:
city_in_us={"City name": ["New_york", "Chicago", "New jersey", "Virginia", "Washington"]}

In [24]:
city_in_us

{'City name': ['New_york', 'Chicago', 'New jersey', 'Virginia', 'Washington']}

In [25]:
city_in_us.values()

dict_values([['New_york', 'Chicago', 'New jersey', 'Virginia', 'Washington']])

In [26]:
city_in_us=pd.DataFrame({"City name": ["New_york", "Chicago", "New jersey", "Virginia", "Washington"]})

In [27]:
city_in_us

    City name
0    New_york
1     Chicago
2  New jersey
3    Virginia
4  Washington

In [28]:
pd.concat([city_in_us, city_in_uk])

    City name
0    New_york
1     Chicago
2  New jersey
3    Virginia
4  Washington
0      London
1  Birmingham
2   Liverpool
3  Manchester
4    Bradford

In [29]:
pd.concat([city_in_us, city_in_uk], ignore_index=True)

    City name
0    New_york
1     Chicago
2  New jersey
3    Virginia
4  Washington
5      London
6  Birmingham
7   Liverpool
8  Manchester
9    Bradford

In [30]:
temp1=pd.DataFrame({"City": ["London", "Birmingham", "Manchester"],
      "Temperature": [10,5,7]
     })

In [31]:
temp2=pd.DataFrame({"City": ["London", "Birmingham", "Manchester"],
                   "Windspeed": [20,11,16]
                   })

In [32]:
pd.concat([temp1, temp2]) #bydefault concat have axis=0 means put city column on same column

         City  Temperature  Windspeed
0      London         10.0        NaN
1  Birmingham          5.0        NaN
2  Manchester          7.0        NaN
0      London          NaN       20.0
1  Birmingham          NaN       11.0
2  Manchester          NaN       16.0

In [45]:
temp3=pd.concat([temp1, temp2], axis=1) # here axis=1 means create city on another column

In [34]:
temp3

         City  Temperature        City  Windspeed
0      London           10      London         20
1  Birmingham            5  Birmingham         11
2  Manchester            7  Manchester         16

In [35]:
temp3.drop("City",axis=1)

   Temperature  Windspeed
0           10         20
1            5         11
2            7         16

In [36]:
temp2

         City  Windspeed
0      London         20
1  Birmingham         11
2  Manchester         16

In [41]:
s=pd.Series(["Sunny", "Rainy", "Cloudy"], name="Day") #use Series function for adding only column not rows

In [44]:
pd.concat([temp2, s], axis=1)

         City  Windspeed     Day
0      London         20   Sunny
1  Birmingham         11   Rainy
2  Manchester         16  Cloudy